import { MigrationInterface, QueryRunner } from 'typeorm';

export class Data1724132271666 implements MigrationInterface {
  public async up(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(
      "INSERT INTO `user`(`id`,`username`,`password`,`email`,`phoneNumber`,`isFrozen`,`isAdmin`,`createTime`,`updateTime`,`nickName`,`headPic`) VALUES (5,'juntong','850880e045dfe6ab98f80bd7f995a613','13714040198@163.com','13714040198',0,1,'2024-08-12 05:57:55.603869','2024-08-15 08:37:55.153193','Inigo','uploads/cube5.jpg'),(8,'tong','96e79218965eb72c92a549dd5a330112','1095785257@qq.com',NULL,0,0,'2024-08-14 10:09:42.686559','2024-08-18 07:54:37.000000','xxt','uploads/cube2.jpg'),(9,'1111','e10adc3949ba59abbe56e057f20f883e','178327@qq.com',NULL,0,0,'2024-08-16 09:25:55.393153','2024-08-16 09:25:55.393153','aaaa',''),(10,'zjt','96e79218965eb72c92a549dd5a330112','xx@gmail.com',NULL,0,0,'2024-08-16 09:27:35.614094','2024-08-16 09:27:35.614094','holdon',''),(11,'xiaotong','96e79218965eb72c92a549dd5a330112','dfd@163.com',NULL,0,0,'2024-08-16 09:28:50.225187','2024-08-16 09:28:50.225187','ccccute','')",
    );
    await queryRunner.query(
      "INSERT INTO `meeting_room` VALUES (1,'万宁',14,'四层404','液晶电视,电脑,会议桌,投影仪','该会议室景色十分优美，有助于提升开会效率，放松心情',0,'2024-08-15 11:21:59.163324','2024-08-16 07:32:56.000000'),(4,'三亚',40,'四层410','液晶电视,电脑,会议桌,投影仪,白板','该会议室位置优越，景色十分优美，有助于提升开会效率，放松心情。同时容纳人数多，适合部门人数多的使用',0,'2024-08-16 05:53:57.687616','2024-08-16 05:53:57.687616'),(5,'文昌',20,'四层401','电脑,会议桌,白板','该会议室位置优越，景色十分优美，有助于提升开会效率，放松心情。',0,'2024-08-16 05:55:08.819023','2024-08-16 05:55:08.819023'),(6,'儋州',6,'三层303','投影仪,桌子,白板','该会议室具有十分悠久的历史，很多著名的会议都在这里召开',0,'2024-08-16 07:11:47.944199','2024-08-16 07:11:47.944199'),(7,'东方',18,'三层308','液晶电视,桌子,白板','古老的东方市',0,'2024-08-16 07:55:37.676804','2024-08-16 07:55:37.676804'),(8,'博鳌',140,'５层','会场,大电视,N多座椅,演讲台,电脑,投影仪','博鳌亚洲论坛',0,'2024-08-18 07:59:06.965301','2024-08-18 07:59:06.965301')",
    );
    await queryRunner.query(
      "INSERT INTO `booking`(`id`,`note`,`createTime`,`updateTime`,`userId`,`meetingRoomId`,`startTime`,`endTime`,`status`) VALUES (2,'好的开始读书打卡顺丰开会开会我','2024-08-16 16:25:00.737000','2024-08-17 07:05:02.000000',11,4,'2024-08-18 02:04:00','2024-08-18 03:04:00','2'),(8,'scdfs','2024-08-17 04:07:29.152352','2024-08-17 09:16:41.000000',11,4,'2024-08-17 18:07:00','2024-08-17 19:02:00','3'),(9,'hdkshk','2024-08-17 10:01:55.601689','2024-08-17 10:01:55.601689',9,5,'2024-08-20 02:00:00','2024-08-20 03:00:00','0'),(10,'','2024-08-17 14:34:53.692856','2024-08-17 15:09:37.000000',11,6,'2024-08-20 01:00:00','2024-08-20 02:10:00','1'),(11,'','2024-08-17 14:36:21.159870','2024-08-17 14:36:21.159870',11,1,'2024-08-20 01:00:00','2024-08-20 02:19:00','0'),(12,'个等级和撒个娇还是感觉很多公司给第五个逗我','2024-08-18 07:52:38.430512','2024-08-18 07:53:36.000000',10,7,'2024-08-27 07:00:00','2024-08-27 09:00:00','1'),(13,'bdajhshbjh大师的会计啊啥的快乐就是','2024-08-18 07:53:12.509086','2024-08-18 07:53:12.509086',10,1,'2024-08-30 03:00:00','2024-08-30 04:00:00','0'),(14,'别的哈啥事都看见了是丢我环球的','2024-08-18 07:55:05.989261','2024-08-18 07:55:05.989261',8,6,'2024-09-02 08:00:00','2024-09-02 10:00:00','0'),(15,'bdhskgsg个电话就是该放假了都是高科技复合物发货','2024-08-18 07:55:32.627167','2024-08-18 07:56:23.000000',8,5,'2024-08-25 06:00:00','2024-08-25 07:30:00','1'),(16,'觉得撒旦教睡个好觉大概赛庚啶五七工第一我去郭德纲打火机','2024-08-18 07:59:32.522443','2024-08-18 07:59:43.000000',8,8,'2024-08-23 02:00:00','2024-08-24 10:00:00','1'),(17,'绑定手机的撒个谎度护卫犬规定个武器','2024-08-18 08:00:45.849477','2024-08-18 08:01:15.000000',9,8,'2024-08-26 02:06:00','2024-08-26 10:05:00','1'),(18,'dnsjkskjhd','2024-08-18 09:24:27.474850','2024-08-18 09:24:27.474850',9,1,'2024-08-18 00:00:00','2024-08-18 07:00:00','0'),(19,'dsbkdshk','2024-08-18 09:28:01.143270','2024-08-18 09:28:01.143270',9,5,'2024-08-30 06:00:00','2024-08-31 09:10:00','0')",
    );
    await queryRunner.query(
      "INSERT INTO `permission` VALUES (1,'frontend','前端专属会议室'),(2,'room1','万宁'),(3,'room2','博鳌'),(4,'room3','三亚'),(5,'room4','文昌'),(6,'tester','测试专属会议室'),(7,'backend','后端专属会议室'),(8,' production','产品专属会议室')",
    );

    await queryRunner.query(
      "INSERT INTO `role` VALUES (1,'管理员'),(4,'frontend'),(5,'tester'),(6,'backend'),(7,'production')",
    );

    await queryRunner.query(
      'INSERT INTO `role_permissions` VALUES (1,1),(1,2),(1,3),(1,4),(1,5),(1,6),(1,7),(1,8),(4,1),(4,2),(4,3),(4,4),(4,5),(5,1),(5,2),(5,3),(5,4),(5,5),(6,1),(6,2),(6,3),(6,4),(6,5),(7,1),(7,2),(7,3),(7,4),(7,5)',
    );

    await queryRunner.query(
      'INSERT INTO `user_roles` VALUES (5,1),(8,4),(9,5),(10,6),(11,7)',
    );
  }

  public async down(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query('TRUNCATE TABLE booking');
  }
}
